#+TITLE: OTP behind the scenes for Elixir developers

** Day one

|-------+----------+----------------------------|
| Start | Duration | Session                    |
|-------+----------+----------------------------|
|  9:00 |    01:30 | [[Life Before OTP Part One]]   |
| 10:30 |    00:30 | Break                      |
| 11:00 |    01:30 | [[Life Before OTP Part Two]]   |
| 12:30 |    01:00 | Lunch Break                |
| 13:30 |    01:30 | [[Life Before OTP Part Three]] |
| 15:00 |    00:30 | Break                      |
| 15:30 |    01:30 | [[Generic Servers]]            |
| 17:00 |          | End                        |
|-------+----------+----------------------------|
#+TBLFM: @<<$2..@>>$2=@+1$1-$1;U

** Day two

|-------+----------+---------------------------------|
| Start | Duration | Session                         |
|-------+----------+---------------------------------|
|  9:00 |    01:30 | [[Generic State Machines Part One]] |
| 10:30 |    00:30 | Break                           |
| 11:00 |    01:30 | [[Generic State Machines Part Two]] |
| 12:30 |    01:00 | Lunch Break                     |
| 13:30 |    01:30 | [[Erlang Term Storage]]             |
| 15:00 |    00:30 | Break                           |
| 15:30 |    01:30 | fourth Session                  |
| 17:00 |          | End                             |
|-------+----------+---------------------------------|
#+TBLFM: @<<$2..@>>$2=@+1$1-$1;U

** Day three

|-------+----------+--------------------------------------------|
| Start | Duration | Session                                    |
|-------+----------+--------------------------------------------|
|  9:00 |    01:30 | first session                              |
| 10:30 |    00:30 | Break                                      |
| 11:00 |    01:30 | Load Regulation with Fuse and Safety Valve |
| 12:30 |    01:00 | Lunch Break                                |
| 13:30 |    01:30 | Load Regulation with Fuse and Safety Valve |
| 15:00 |    00:30 | Break                                      |
| 15:30 |    01:30 | fourth Session                             |
| 17:00 |          | End                                        |
|-------+----------+--------------------------------------------|
#+TBLFM: @<<$2..@>>$2=@+1$1-$1;U

